In [1]:
import pandas as pd 
df=pd.read_csv(r"C:\Users\prashanthi\Downloads\data.csv")
df

,NAME,CLASS,SECTION,ROLLNO,EMAIL,PHNO,MARKS
0,B.Yamuna,AIR,A,37,yamunalovely9@gmail.com,8897859569,NaN
1,P.Devi,AIR,A,58,gundrasivesaidurga@gmail.com,9347791232,97.0
2,J.Ramya,AIR,NaN,52,jivvireddyramyasri@gmailcom,9676976652,NaN
3,K.Prasanthi,AIR,A,41,kesanakurthiprasanthi@gmail.com,7382934586,85.0
4,K.V. Niharika,AIR,A,54,karreveeraniharika@gmail.com,9182532802,96.0
5,K.Sri Niharika,AIR,A,9,karresriniharika@gmail.com,6300408089,90.0
6,Y.Kaveri,AIR,NaN,3,yendamurikaveri@gmail.com,7386015549,NaN
7,P.Durga,AIR,A,24,durgarani@gmail.com,8466845651,89.0
8,P.Akhila,AIR,A,29,bottaakhila@gmail.com,8397941799,90.0
9,P.Neelima,AIR,A,36,pinapalaramesh@gmail.com,7386803023,NaN

# String Cleaning

In [2]:
import pandas as pd
df= pd.read_csv(r"C:\Users\prashanthi\Downloads\data.csv")
df

,NAME,CLASS,SECTION,ROLLNO,EMAIL,PHNO,MARKS
0,B.Yamuna,AIR,A,37,yamunalovely9@gmail.com,8897859569,NaN
1,P.Devi,AIR,A,58,gundrasivesaidurga@gmail.com,9347791232,97.0
2,J.Ramya,AIR,NaN,52,jivvireddyramyasri@gmailcom,9676976652,NaN
3,K.Prasanthi,AIR,A,41,kesanakurthiprasanthi@gmail.com,7382934586,85.0
4,K.V. Niharika,AIR,A,54,karreveeraniharika@gmail.com,9182532802,96.0
5,K.Sri Niharika,AIR,A,9,karresriniharika@gmail.com,6300408089,90.0
6,Y.Kaveri,AIR,NaN,3,yendamurikaveri@gmail.com,7386015549,NaN
7,P.Durga,AIR,A,24,durgarani@gmail.com,8466845651,89.0
8,P.Akhila,AIR,A,29,bottaakhila@gmail.com,8397941799,90.0
9,P.Neelima,AIR,A,36,pinapalaramesh@gmail.com,7386803023,NaN

In [3]:
df['NAME']=df['NAME'].str.upper()
df

,NAME,CLASS,SECTION,ROLLNO,EMAIL,PHNO,MARKS
0,B.YAMUNA,AIR,A,37,yamunalovely9@gmail.com,8897859569,NaN
1,P.DEVI,AIR,A,58,gundrasivesaidurga@gmail.com,9347791232,97.0
2,J.RAMYA,AIR,NaN,52,jivvireddyramyasri@gmailcom,9676976652,NaN
3,K.PRASANTHI,AIR,A,41,kesanakurthiprasanthi@gmail.com,7382934586,85.0
4,K.V. NIHARIKA,AIR,A,54,karreveeraniharika@gmail.com,9182532802,96.0
5,K.SRI NIHARIKA,AIR,A,9,karresriniharika@gmail.com,6300408089,90.0
6,Y.KAVERI,AIR,NaN,3,yendamurikaveri@gmail.com,7386015549,NaN
7,P.DURGA,AIR,A,24,durgarani@gmail.com,8466845651,89.0
8,P.AKHILA,AIR,A,29,bottaakhila@gmail.com,8397941799,90.0
9,P.NEELIMA,AIR,A,36,pinapalaramesh@gmail.com,7386803023,NaN

In [4]:
df['NAME']=df['NAME'].str.lower()
df

,NAME,CLASS,SECTION,ROLLNO,EMAIL,PHNO,MARKS
0,b.yamuna,AIR,A,37,yamunalovely9@gmail.com,8897859569,NaN
1,p.devi,AIR,A,58,gundrasivesaidurga@gmail.com,9347791232,97.0
2,j.ramya,AIR,NaN,52,jivvireddyramyasri@gmailcom,9676976652,NaN
3,k.prasanthi,AIR,A,41,kesanakurthiprasanthi@gmail.com,7382934586,85.0
4,k.v. niharika,AIR,A,54,karreveeraniharika@gmail.com,9182532802,96.0
5,k.sri niharika,AIR,A,9,karresriniharika@gmail.com,6300408089,90.0
6,y.kaveri,AIR,NaN,3,yendamurikaveri@gmail.com,7386015549,NaN
7,p.durga,AIR,A,24,durgarani@gmail.com,8466845651,89.0
8,p.akhila,AIR,A,29,bottaakhila@gmail.com,8397941799,90.0
9,p.neelima,AIR,A,36,pinapalaramesh@gmail.com,7386803023,NaN

In [6]:
df['NAME'].str.lower()

0          b.yamuna
1            p.devi
2          j.ramya
3       k.prasanthi
4     k.v. niharika
5    k.sri niharika
6          y.kaveri
7           p.durga
8          p.akhila
9         p.neelima
Name: NAME, dtype: object

# Concatenate DataFrames

In [7]:
india=pd.DataFrame({
    "city": ["Mumbai","Agra","Banglore"],
    "temp": [34,23,45]
})
india

       city  temp
0    Mumbai    34
1      Agra    23
2  Banglore    45

In [8]:
us=pd.DataFrame({
    "city": ["Chicago", "Newyork"," Ireland"],
    "temp": [45,23,67]
})
us

       city  temp
0   Chicago    45
1   Newyork    23
2   Ireland    67

In [9]:
df=pd.concat([india,us])
df

       city  temp
0    Mumbai    34
1      Agra    23
2  Banglore    45
0   Chicago    45
1   Newyork    23
2   Ireland    67

In [10]:
df=pd.concat([india,us],ignore_index=True) # it gives line by line ignore index true means it follow ordered index
df

       city  temp
0    Mumbai    34
1      Agra    23
2  Banglore    45
3   Chicago    45
4   Newyork    23
5   Ireland    67

In [11]:
df= pd.concat([india,us],axis=1) # it gives side by side tables
df

       city  temp      city  temp
0    Mumbai    34   Chicago    45
1      Agra    23   Newyork    23
2  Banglore    45   Ireland    67

# Merge dataframes

In [12]:
temp=pd.DataFrame({
    "city":["hyd","vzg","N"],
    "tempt":[34,45,67]
})
temp

  city  tempt
0  hyd     34
1  vzg     45
2    N     67

In [13]:
t=pd.DataFrame({
    "city":["hyd","vzg","vijy"],
    "rainfall":[36,55,77]
})
t

   city  rainfall
0   hyd        36
1   vzg        55
2  vijy        77

In [14]:
df=pd.merge(temp,t,on="city")  #it merges two datas and gives the common columns
df

  city  tempt  rainfall
0  hyd     34        36
1  vzg     45        55

In [15]:
df=pd.merge(temp,t,on="city",how="outer")  #it gives all with null values
df

   city  tempt  rainfall
0   hyd   34.0      36.0
1   vzg   45.0      55.0
2     N   67.0       NaN
3  vijy    NaN      77.0

In [16]:
df.isnull()

    city  tempt  rainfall
0  False  False     False
1  False  False     False
2  False  False      True
3  False   True     False

In [17]:
df.isnull().sum()

city        0
tempt       1
rainfall    1
dtype: int64

In [18]:
df["rainfall"]=df["rainfall"].fillna(df.rainfall.min())
df

   city  tempt  rainfall
0   hyd   34.0      36.0
1   vzg   45.0      55.0
2     N   67.0      36.0
3  vijy    NaN      77.0

In [19]:
df["tempt"]=df["tempt"].fillna(df.tempt.max())
df

   city  tempt  rainfall
0   hyd   34.0      36.0
1   vzg   45.0      55.0
2     N   67.0      36.0
3  vijy   67.0      77.0